[
	{
		"name": "Editor-in-Chief: Harold Jaffe",
		"text": "Harold Jaffe is the author of 28 volumes of fiction, docufiction, and non-fiction, including <i>Culture Porn, Goosestep; Death Café, Sacred Outcast: Dispatches from India; Revolutionary Brain; Induced Coma; Anti-Tiwtter: 150 50-Word Stories; Paris 60; Jesus Coyote; 15 Serial Killers; Beyond the Techno-Cave, Terror-dot-Gov, Straight Razor; Eros Anti-Eros; False Positive; Beasts; Mourning Crazy Horse; Madonna & Other Spectacles; and Dos Indios</i>.",
		"image": "jaffe.jpg"
	},
	{
		"name": "Associate Editor: Matt Fowler",
		"text": "Matt Fowler grew up outside of baltimore, maryland. their work has appeared in online and print publications including <i>Glittermob, Homology Lit Mag, Sycamore Review,</i> and <i>elsewhere</i>. they live in san diego, california with their partner and four dogs.",
		"image": "fowler.png"
	},
	{
		"name": "Associate Editor: Kurt Kroeber",
		"text": "Kurt Kroeber likes to put words into sentences, paragraphs, etc. He’s not published in any fancy literature magazines, but doesn’t really seem to give a care about that rat race (or at least that’s what he tells himself so he can sleep at night). Kurt writes for the <a target='blank' href='https://www.wearetheguard.com/'>We Are: The Guard</a> music blog and in his spare time creates the <a target='_blank' href='https://novelizationsbykurt.tumblr.com/'>Movie Novelization</a> version of films currently in theatres. He co-wrote the feature film <i><a target='_blank' href='https://www.youtube.com/watch?v=FOeubUTkkRM'>Psycho Sleepover</a></i> which you can watch free on the internet if you are tenacious enough and have an affinity for schlocky horror-comedies. Happy Birthday! Follow him on twitter at <a target='_blank' href='https://twitter.com/wwwkurtcom'>@wwwkurtcom</a>.",
		"image": "kroeber.jpg"
	},
	{
		"name": "Associate Editor: Laura Mazzenga",
		"text": "Laura has a professional background in journalism, and worked in healthcare communications for the majority of her career. Her history in news-reporting gives her a clear, literal voice which still lingers in her writing style. Laura loves writing about people, particularly insane or ill characters, and enjoys the study of people and relationships both on and off the page. She also loves traveling, spending time in nature, and trying to read her cat’s thoughts 😺",
		"image": "mazzenga.png"
	},
	{
		"name": "Associate Editor: Angela Pankosky",
		"text": "Angela Pankosky is a Polish writer, mother, and dancer. She earned B.A. in Comparative Literature from SDSU in 2011 and is currently a graduate student in Creative Writing with emphasis in poetry. Her biggest literary influences are Anaïs Nin,  Halina Poświatowska, and Helena Raszka.<br>You can read one of her latest poems, “Snuff yourself” in the <a target='_blank' href='https://blackscatbooks.com/category/le-scat-noir/'>January 2018 issue of Le Scat Noir</a>or \"The Brother\" in the <a target='_blank' href='https://www.amazon.com/San-Diego-Poetry-Annual-2017-18/dp/1984044117?crid=5RV8M13IV540&keywords=san+diego+poetry+annual&qid=1536817049&sprefix=san+diego+poetry+&sr=8-1&ref=mp_s_a_1_1'>San Diego Poetry Annual</a> Anthology. Also check out one of her short stories \"Between Borders\" in the <a target='_blank' href='https://www.amazon.com/New-pacificREVIEW-2018-Frontera-PACIFIC/dp/0916304183/ref=as_li_ss_tl?m=A119ICNS1106UD&s=merchant-items&ie=UTF8&qid=1538430752&sr=1-5&keywords=pacific&linkCode=sl1&tag=sdsupress-20&linkId=41f72bdc9f90115bcc2c23ff2b2240a5&language=en_US'>most recent issue of pacificREVIEW</a>!",
		"image": "pankosky.jpeg"
	}
]